{
  "add_bos_token": true,
  "add_eos_token": false,
  "add_prefix_space": true,
  "added_tokens_decoder": {
    "0": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<s>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "</s>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [],
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": false,
  "cls_token": null,
  "eos_token": "</s>",
  "extra_special_tokens": {},
  "legacy": false,
  "mask_token": null,
  "model_input_names": [
    "input_ids",
    "attention_mask"
  ],
  "model_max_length": 4096,
  "pad_token": "</s>",
  "padding_side": "right",
  "sep_token": null,
  "split_special_tokens": false,
  "tokenizer_class": "LlamaTokenizerFast",
  "truncation_side": "right",
  "unk_token": "<unk>",
  "use_default_system_prompt": true
}
